import {useAppContext} from "@/context/app/AppReducer";

export default function TermUI() {
	const app = useAppContext();
	const {init} = app;
	if (init == false) {
		return <ConditionTerm />;
	}
}

function ConditionTerm() {
	return (
		<div className="px-3 py-2">
			<div>เงื่อนไข</div>
			<ol className="px-6 text-xs list-decimal">
				<li>
					เปิดออเดอร์ มัดจำค่าออกแบบ 1,000 หากลูกค้าสั่งผลิต
					เงินจำนวนนี้จะรวมในออเดอร์
				</li>
				<li>กรณีลูกค้ายกเลิกออเดอร์ เงินจำนวนดังกล่าวจะคิดเป็นค่าออกแบบ</li>
				<li>
					ระยะเวลาการผลิต จะคำนวนตามจำนวนที่สั่ง
					แอดมินจะแจ้งอีกทีหลังจากทราบจำนวนที่แท้จริง
					และนับระยะเวลาผลิตจากที่ลูกค้ายืนยันแบบ, ยืนยันสี และมัดจำ 50%
				</li>
				<li>
					กรณีลูกค้ามีกำหนด วัน/เวลา รับของที่ชัดเจน ให้แจ้งแอดมินก่อน
					เพื่อให้แอดมินเช็คเวลาสามารถการผลิตว่าสามารถทำได้ทันตามเวลาที่กำหนดหรือไม่
				</li>

				<li>กรณีลูกค้าแก้ไขข้อมูลในภายหลัง ราคาอาจมีการเปลี่ยนแปลง</li>

				<li>
					หลังจากเปิดออเดอร์แล้ว หากอยู่ในระหว่างการออกแบบ หรือสรุปสี
					ลูกค้าสามารถเปลี่ยน/จำนวนและราคาได้
				</li>
				<li>หากยืนยันการผลิตแล้วจะไม่สามารถเปลี่ยนแปลงข้อมูลได้</li>
			</ol>
		</div>
	);
}
